###################################################################

# Created by write_sdc on Mon Jan 22 14:32:19 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_data[7]}]
set_load -pin_load 0.05 [get_ports {out_data[6]}]
set_load -pin_load 0.05 [get_ports {out_data[5]}]
set_load -pin_load 0.05 [get_ports {out_data[4]}]
set_load -pin_load 0.05 [get_ports {out_data[3]}]
set_load -pin_load 0.05 [get_ports {out_data[2]}]
set_load -pin_load 0.05 [get_ports {out_data[1]}]
set_load -pin_load 0.05 [get_ports {out_data[0]}]
set_load -pin_load 0.05 [get_ports AR_VALID]
set_load -pin_load 0.05 [get_ports {AR_ADDR[31]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[30]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[29]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[28]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[27]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[26]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[25]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[24]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[23]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[22]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[21]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[20]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[19]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[18]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[17]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[16]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[15]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[14]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[13]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[12]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[11]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[10]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[9]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[8]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[7]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[6]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[5]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[4]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[3]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[2]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[1]}]
set_load -pin_load 0.05 [get_ports {AR_ADDR[0]}]
set_load -pin_load 0.05 [get_ports R_READY]
set_load -pin_load 0.05 [get_ports AW_VALID]
set_load -pin_load 0.05 [get_ports {AW_ADDR[31]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[30]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[29]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[28]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[27]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[26]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[25]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[24]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[23]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[22]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[21]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[20]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[19]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[18]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[17]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[16]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[15]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[14]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[13]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[12]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[11]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[10]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[9]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[8]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[7]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[6]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[5]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[4]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[3]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[2]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[1]}]
set_load -pin_load 0.05 [get_ports {AW_ADDR[0]}]
set_load -pin_load 0.05 [get_ports W_VALID]
set_load -pin_load 0.05 [get_ports {W_DATA[63]}]
set_load -pin_load 0.05 [get_ports {W_DATA[62]}]
set_load -pin_load 0.05 [get_ports {W_DATA[61]}]
set_load -pin_load 0.05 [get_ports {W_DATA[60]}]
set_load -pin_load 0.05 [get_ports {W_DATA[59]}]
set_load -pin_load 0.05 [get_ports {W_DATA[58]}]
set_load -pin_load 0.05 [get_ports {W_DATA[57]}]
set_load -pin_load 0.05 [get_ports {W_DATA[56]}]
set_load -pin_load 0.05 [get_ports {W_DATA[55]}]
set_load -pin_load 0.05 [get_ports {W_DATA[54]}]
set_load -pin_load 0.05 [get_ports {W_DATA[53]}]
set_load -pin_load 0.05 [get_ports {W_DATA[52]}]
set_load -pin_load 0.05 [get_ports {W_DATA[51]}]
set_load -pin_load 0.05 [get_ports {W_DATA[50]}]
set_load -pin_load 0.05 [get_ports {W_DATA[49]}]
set_load -pin_load 0.05 [get_ports {W_DATA[48]}]
set_load -pin_load 0.05 [get_ports {W_DATA[47]}]
set_load -pin_load 0.05 [get_ports {W_DATA[46]}]
set_load -pin_load 0.05 [get_ports {W_DATA[45]}]
set_load -pin_load 0.05 [get_ports {W_DATA[44]}]
set_load -pin_load 0.05 [get_ports {W_DATA[43]}]
set_load -pin_load 0.05 [get_ports {W_DATA[42]}]
set_load -pin_load 0.05 [get_ports {W_DATA[41]}]
set_load -pin_load 0.05 [get_ports {W_DATA[40]}]
set_load -pin_load 0.05 [get_ports {W_DATA[39]}]
set_load -pin_load 0.05 [get_ports {W_DATA[38]}]
set_load -pin_load 0.05 [get_ports {W_DATA[37]}]
set_load -pin_load 0.05 [get_ports {W_DATA[36]}]
set_load -pin_load 0.05 [get_ports {W_DATA[35]}]
set_load -pin_load 0.05 [get_ports {W_DATA[34]}]
set_load -pin_load 0.05 [get_ports {W_DATA[33]}]
set_load -pin_load 0.05 [get_ports {W_DATA[32]}]
set_load -pin_load 0.05 [get_ports {W_DATA[31]}]
set_load -pin_load 0.05 [get_ports {W_DATA[30]}]
set_load -pin_load 0.05 [get_ports {W_DATA[29]}]
set_load -pin_load 0.05 [get_ports {W_DATA[28]}]
set_load -pin_load 0.05 [get_ports {W_DATA[27]}]
set_load -pin_load 0.05 [get_ports {W_DATA[26]}]
set_load -pin_load 0.05 [get_ports {W_DATA[25]}]
set_load -pin_load 0.05 [get_ports {W_DATA[24]}]
set_load -pin_load 0.05 [get_ports {W_DATA[23]}]
set_load -pin_load 0.05 [get_ports {W_DATA[22]}]
set_load -pin_load 0.05 [get_ports {W_DATA[21]}]
set_load -pin_load 0.05 [get_ports {W_DATA[20]}]
set_load -pin_load 0.05 [get_ports {W_DATA[19]}]
set_load -pin_load 0.05 [get_ports {W_DATA[18]}]
set_load -pin_load 0.05 [get_ports {W_DATA[17]}]
set_load -pin_load 0.05 [get_ports {W_DATA[16]}]
set_load -pin_load 0.05 [get_ports {W_DATA[15]}]
set_load -pin_load 0.05 [get_ports {W_DATA[14]}]
set_load -pin_load 0.05 [get_ports {W_DATA[13]}]
set_load -pin_load 0.05 [get_ports {W_DATA[12]}]
set_load -pin_load 0.05 [get_ports {W_DATA[11]}]
set_load -pin_load 0.05 [get_ports {W_DATA[10]}]
set_load -pin_load 0.05 [get_ports {W_DATA[9]}]
set_load -pin_load 0.05 [get_ports {W_DATA[8]}]
set_load -pin_load 0.05 [get_ports {W_DATA[7]}]
set_load -pin_load 0.05 [get_ports {W_DATA[6]}]
set_load -pin_load 0.05 [get_ports {W_DATA[5]}]
set_load -pin_load 0.05 [get_ports {W_DATA[4]}]
set_load -pin_load 0.05 [get_ports {W_DATA[3]}]
set_load -pin_load 0.05 [get_ports {W_DATA[2]}]
set_load -pin_load 0.05 [get_ports {W_DATA[1]}]
set_load -pin_load 0.05 [get_ports {W_DATA[0]}]
set_load -pin_load 0.05 [get_ports B_READY]
set_load -pin_load 0.05 [get_ports MOSI]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports direction]
set_max_capacitance 0.15 [get_ports {addr_dram[12]}]
set_max_capacitance 0.15 [get_ports {addr_dram[11]}]
set_max_capacitance 0.15 [get_ports {addr_dram[10]}]
set_max_capacitance 0.15 [get_ports {addr_dram[9]}]
set_max_capacitance 0.15 [get_ports {addr_dram[8]}]
set_max_capacitance 0.15 [get_ports {addr_dram[7]}]
set_max_capacitance 0.15 [get_ports {addr_dram[6]}]
set_max_capacitance 0.15 [get_ports {addr_dram[5]}]
set_max_capacitance 0.15 [get_ports {addr_dram[4]}]
set_max_capacitance 0.15 [get_ports {addr_dram[3]}]
set_max_capacitance 0.15 [get_ports {addr_dram[2]}]
set_max_capacitance 0.15 [get_ports {addr_dram[1]}]
set_max_capacitance 0.15 [get_ports {addr_dram[0]}]
set_max_capacitance 0.15 [get_ports {addr_sd[15]}]
set_max_capacitance 0.15 [get_ports {addr_sd[14]}]
set_max_capacitance 0.15 [get_ports {addr_sd[13]}]
set_max_capacitance 0.15 [get_ports {addr_sd[12]}]
set_max_capacitance 0.15 [get_ports {addr_sd[11]}]
set_max_capacitance 0.15 [get_ports {addr_sd[10]}]
set_max_capacitance 0.15 [get_ports {addr_sd[9]}]
set_max_capacitance 0.15 [get_ports {addr_sd[8]}]
set_max_capacitance 0.15 [get_ports {addr_sd[7]}]
set_max_capacitance 0.15 [get_ports {addr_sd[6]}]
set_max_capacitance 0.15 [get_ports {addr_sd[5]}]
set_max_capacitance 0.15 [get_ports {addr_sd[4]}]
set_max_capacitance 0.15 [get_ports {addr_sd[3]}]
set_max_capacitance 0.15 [get_ports {addr_sd[2]}]
set_max_capacitance 0.15 [get_ports {addr_sd[1]}]
set_max_capacitance 0.15 [get_ports {addr_sd[0]}]
set_max_capacitance 0.15 [get_ports AR_READY]
set_max_capacitance 0.15 [get_ports R_VALID]
set_max_capacitance 0.15 [get_ports {R_RESP[1]}]
set_max_capacitance 0.15 [get_ports {R_RESP[0]}]
set_max_capacitance 0.15 [get_ports {R_DATA[63]}]
set_max_capacitance 0.15 [get_ports {R_DATA[62]}]
set_max_capacitance 0.15 [get_ports {R_DATA[61]}]
set_max_capacitance 0.15 [get_ports {R_DATA[60]}]
set_max_capacitance 0.15 [get_ports {R_DATA[59]}]
set_max_capacitance 0.15 [get_ports {R_DATA[58]}]
set_max_capacitance 0.15 [get_ports {R_DATA[57]}]
set_max_capacitance 0.15 [get_ports {R_DATA[56]}]
set_max_capacitance 0.15 [get_ports {R_DATA[55]}]
set_max_capacitance 0.15 [get_ports {R_DATA[54]}]
set_max_capacitance 0.15 [get_ports {R_DATA[53]}]
set_max_capacitance 0.15 [get_ports {R_DATA[52]}]
set_max_capacitance 0.15 [get_ports {R_DATA[51]}]
set_max_capacitance 0.15 [get_ports {R_DATA[50]}]
set_max_capacitance 0.15 [get_ports {R_DATA[49]}]
set_max_capacitance 0.15 [get_ports {R_DATA[48]}]
set_max_capacitance 0.15 [get_ports {R_DATA[47]}]
set_max_capacitance 0.15 [get_ports {R_DATA[46]}]
set_max_capacitance 0.15 [get_ports {R_DATA[45]}]
set_max_capacitance 0.15 [get_ports {R_DATA[44]}]
set_max_capacitance 0.15 [get_ports {R_DATA[43]}]
set_max_capacitance 0.15 [get_ports {R_DATA[42]}]
set_max_capacitance 0.15 [get_ports {R_DATA[41]}]
set_max_capacitance 0.15 [get_ports {R_DATA[40]}]
set_max_capacitance 0.15 [get_ports {R_DATA[39]}]
set_max_capacitance 0.15 [get_ports {R_DATA[38]}]
set_max_capacitance 0.15 [get_ports {R_DATA[37]}]
set_max_capacitance 0.15 [get_ports {R_DATA[36]}]
set_max_capacitance 0.15 [get_ports {R_DATA[35]}]
set_max_capacitance 0.15 [get_ports {R_DATA[34]}]
set_max_capacitance 0.15 [get_ports {R_DATA[33]}]
set_max_capacitance 0.15 [get_ports {R_DATA[32]}]
set_max_capacitance 0.15 [get_ports {R_DATA[31]}]
set_max_capacitance 0.15 [get_ports {R_DATA[30]}]
set_max_capacitance 0.15 [get_ports {R_DATA[29]}]
set_max_capacitance 0.15 [get_ports {R_DATA[28]}]
set_max_capacitance 0.15 [get_ports {R_DATA[27]}]
set_max_capacitance 0.15 [get_ports {R_DATA[26]}]
set_max_capacitance 0.15 [get_ports {R_DATA[25]}]
set_max_capacitance 0.15 [get_ports {R_DATA[24]}]
set_max_capacitance 0.15 [get_ports {R_DATA[23]}]
set_max_capacitance 0.15 [get_ports {R_DATA[22]}]
set_max_capacitance 0.15 [get_ports {R_DATA[21]}]
set_max_capacitance 0.15 [get_ports {R_DATA[20]}]
set_max_capacitance 0.15 [get_ports {R_DATA[19]}]
set_max_capacitance 0.15 [get_ports {R_DATA[18]}]
set_max_capacitance 0.15 [get_ports {R_DATA[17]}]
set_max_capacitance 0.15 [get_ports {R_DATA[16]}]
set_max_capacitance 0.15 [get_ports {R_DATA[15]}]
set_max_capacitance 0.15 [get_ports {R_DATA[14]}]
set_max_capacitance 0.15 [get_ports {R_DATA[13]}]
set_max_capacitance 0.15 [get_ports {R_DATA[12]}]
set_max_capacitance 0.15 [get_ports {R_DATA[11]}]
set_max_capacitance 0.15 [get_ports {R_DATA[10]}]
set_max_capacitance 0.15 [get_ports {R_DATA[9]}]
set_max_capacitance 0.15 [get_ports {R_DATA[8]}]
set_max_capacitance 0.15 [get_ports {R_DATA[7]}]
set_max_capacitance 0.15 [get_ports {R_DATA[6]}]
set_max_capacitance 0.15 [get_ports {R_DATA[5]}]
set_max_capacitance 0.15 [get_ports {R_DATA[4]}]
set_max_capacitance 0.15 [get_ports {R_DATA[3]}]
set_max_capacitance 0.15 [get_ports {R_DATA[2]}]
set_max_capacitance 0.15 [get_ports {R_DATA[1]}]
set_max_capacitance 0.15 [get_ports {R_DATA[0]}]
set_max_capacitance 0.15 [get_ports AW_READY]
set_max_capacitance 0.15 [get_ports W_READY]
set_max_capacitance 0.15 [get_ports B_VALID]
set_max_capacitance 0.15 [get_ports {B_RESP[1]}]
set_max_capacitance 0.15 [get_ports {B_RESP[0]}]
set_max_capacitance 0.15 [get_ports MISO]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports direction]
set_max_fanout 10 [get_ports {addr_dram[12]}]
set_max_fanout 10 [get_ports {addr_dram[11]}]
set_max_fanout 10 [get_ports {addr_dram[10]}]
set_max_fanout 10 [get_ports {addr_dram[9]}]
set_max_fanout 10 [get_ports {addr_dram[8]}]
set_max_fanout 10 [get_ports {addr_dram[7]}]
set_max_fanout 10 [get_ports {addr_dram[6]}]
set_max_fanout 10 [get_ports {addr_dram[5]}]
set_max_fanout 10 [get_ports {addr_dram[4]}]
set_max_fanout 10 [get_ports {addr_dram[3]}]
set_max_fanout 10 [get_ports {addr_dram[2]}]
set_max_fanout 10 [get_ports {addr_dram[1]}]
set_max_fanout 10 [get_ports {addr_dram[0]}]
set_max_fanout 10 [get_ports {addr_sd[15]}]
set_max_fanout 10 [get_ports {addr_sd[14]}]
set_max_fanout 10 [get_ports {addr_sd[13]}]
set_max_fanout 10 [get_ports {addr_sd[12]}]
set_max_fanout 10 [get_ports {addr_sd[11]}]
set_max_fanout 10 [get_ports {addr_sd[10]}]
set_max_fanout 10 [get_ports {addr_sd[9]}]
set_max_fanout 10 [get_ports {addr_sd[8]}]
set_max_fanout 10 [get_ports {addr_sd[7]}]
set_max_fanout 10 [get_ports {addr_sd[6]}]
set_max_fanout 10 [get_ports {addr_sd[5]}]
set_max_fanout 10 [get_ports {addr_sd[4]}]
set_max_fanout 10 [get_ports {addr_sd[3]}]
set_max_fanout 10 [get_ports {addr_sd[2]}]
set_max_fanout 10 [get_ports {addr_sd[1]}]
set_max_fanout 10 [get_ports {addr_sd[0]}]
set_max_fanout 10 [get_ports AR_READY]
set_max_fanout 10 [get_ports R_VALID]
set_max_fanout 10 [get_ports {R_RESP[1]}]
set_max_fanout 10 [get_ports {R_RESP[0]}]
set_max_fanout 10 [get_ports {R_DATA[63]}]
set_max_fanout 10 [get_ports {R_DATA[62]}]
set_max_fanout 10 [get_ports {R_DATA[61]}]
set_max_fanout 10 [get_ports {R_DATA[60]}]
set_max_fanout 10 [get_ports {R_DATA[59]}]
set_max_fanout 10 [get_ports {R_DATA[58]}]
set_max_fanout 10 [get_ports {R_DATA[57]}]
set_max_fanout 10 [get_ports {R_DATA[56]}]
set_max_fanout 10 [get_ports {R_DATA[55]}]
set_max_fanout 10 [get_ports {R_DATA[54]}]
set_max_fanout 10 [get_ports {R_DATA[53]}]
set_max_fanout 10 [get_ports {R_DATA[52]}]
set_max_fanout 10 [get_ports {R_DATA[51]}]
set_max_fanout 10 [get_ports {R_DATA[50]}]
set_max_fanout 10 [get_ports {R_DATA[49]}]
set_max_fanout 10 [get_ports {R_DATA[48]}]
set_max_fanout 10 [get_ports {R_DATA[47]}]
set_max_fanout 10 [get_ports {R_DATA[46]}]
set_max_fanout 10 [get_ports {R_DATA[45]}]
set_max_fanout 10 [get_ports {R_DATA[44]}]
set_max_fanout 10 [get_ports {R_DATA[43]}]
set_max_fanout 10 [get_ports {R_DATA[42]}]
set_max_fanout 10 [get_ports {R_DATA[41]}]
set_max_fanout 10 [get_ports {R_DATA[40]}]
set_max_fanout 10 [get_ports {R_DATA[39]}]
set_max_fanout 10 [get_ports {R_DATA[38]}]
set_max_fanout 10 [get_ports {R_DATA[37]}]
set_max_fanout 10 [get_ports {R_DATA[36]}]
set_max_fanout 10 [get_ports {R_DATA[35]}]
set_max_fanout 10 [get_ports {R_DATA[34]}]
set_max_fanout 10 [get_ports {R_DATA[33]}]
set_max_fanout 10 [get_ports {R_DATA[32]}]
set_max_fanout 10 [get_ports {R_DATA[31]}]
set_max_fanout 10 [get_ports {R_DATA[30]}]
set_max_fanout 10 [get_ports {R_DATA[29]}]
set_max_fanout 10 [get_ports {R_DATA[28]}]
set_max_fanout 10 [get_ports {R_DATA[27]}]
set_max_fanout 10 [get_ports {R_DATA[26]}]
set_max_fanout 10 [get_ports {R_DATA[25]}]
set_max_fanout 10 [get_ports {R_DATA[24]}]
set_max_fanout 10 [get_ports {R_DATA[23]}]
set_max_fanout 10 [get_ports {R_DATA[22]}]
set_max_fanout 10 [get_ports {R_DATA[21]}]
set_max_fanout 10 [get_ports {R_DATA[20]}]
set_max_fanout 10 [get_ports {R_DATA[19]}]
set_max_fanout 10 [get_ports {R_DATA[18]}]
set_max_fanout 10 [get_ports {R_DATA[17]}]
set_max_fanout 10 [get_ports {R_DATA[16]}]
set_max_fanout 10 [get_ports {R_DATA[15]}]
set_max_fanout 10 [get_ports {R_DATA[14]}]
set_max_fanout 10 [get_ports {R_DATA[13]}]
set_max_fanout 10 [get_ports {R_DATA[12]}]
set_max_fanout 10 [get_ports {R_DATA[11]}]
set_max_fanout 10 [get_ports {R_DATA[10]}]
set_max_fanout 10 [get_ports {R_DATA[9]}]
set_max_fanout 10 [get_ports {R_DATA[8]}]
set_max_fanout 10 [get_ports {R_DATA[7]}]
set_max_fanout 10 [get_ports {R_DATA[6]}]
set_max_fanout 10 [get_ports {R_DATA[5]}]
set_max_fanout 10 [get_ports {R_DATA[4]}]
set_max_fanout 10 [get_ports {R_DATA[3]}]
set_max_fanout 10 [get_ports {R_DATA[2]}]
set_max_fanout 10 [get_ports {R_DATA[1]}]
set_max_fanout 10 [get_ports {R_DATA[0]}]
set_max_fanout 10 [get_ports AW_READY]
set_max_fanout 10 [get_ports W_READY]
set_max_fanout 10 [get_ports B_VALID]
set_max_fanout 10 [get_ports {B_RESP[1]}]
set_max_fanout 10 [get_ports {B_RESP[0]}]
set_max_fanout 10 [get_ports MISO]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports direction]
set_max_transition 3 [get_ports {addr_dram[12]}]
set_max_transition 3 [get_ports {addr_dram[11]}]
set_max_transition 3 [get_ports {addr_dram[10]}]
set_max_transition 3 [get_ports {addr_dram[9]}]
set_max_transition 3 [get_ports {addr_dram[8]}]
set_max_transition 3 [get_ports {addr_dram[7]}]
set_max_transition 3 [get_ports {addr_dram[6]}]
set_max_transition 3 [get_ports {addr_dram[5]}]
set_max_transition 3 [get_ports {addr_dram[4]}]
set_max_transition 3 [get_ports {addr_dram[3]}]
set_max_transition 3 [get_ports {addr_dram[2]}]
set_max_transition 3 [get_ports {addr_dram[1]}]
set_max_transition 3 [get_ports {addr_dram[0]}]
set_max_transition 3 [get_ports {addr_sd[15]}]
set_max_transition 3 [get_ports {addr_sd[14]}]
set_max_transition 3 [get_ports {addr_sd[13]}]
set_max_transition 3 [get_ports {addr_sd[12]}]
set_max_transition 3 [get_ports {addr_sd[11]}]
set_max_transition 3 [get_ports {addr_sd[10]}]
set_max_transition 3 [get_ports {addr_sd[9]}]
set_max_transition 3 [get_ports {addr_sd[8]}]
set_max_transition 3 [get_ports {addr_sd[7]}]
set_max_transition 3 [get_ports {addr_sd[6]}]
set_max_transition 3 [get_ports {addr_sd[5]}]
set_max_transition 3 [get_ports {addr_sd[4]}]
set_max_transition 3 [get_ports {addr_sd[3]}]
set_max_transition 3 [get_ports {addr_sd[2]}]
set_max_transition 3 [get_ports {addr_sd[1]}]
set_max_transition 3 [get_ports {addr_sd[0]}]
set_max_transition 3 [get_ports AR_READY]
set_max_transition 3 [get_ports R_VALID]
set_max_transition 3 [get_ports {R_RESP[1]}]
set_max_transition 3 [get_ports {R_RESP[0]}]
set_max_transition 3 [get_ports {R_DATA[63]}]
set_max_transition 3 [get_ports {R_DATA[62]}]
set_max_transition 3 [get_ports {R_DATA[61]}]
set_max_transition 3 [get_ports {R_DATA[60]}]
set_max_transition 3 [get_ports {R_DATA[59]}]
set_max_transition 3 [get_ports {R_DATA[58]}]
set_max_transition 3 [get_ports {R_DATA[57]}]
set_max_transition 3 [get_ports {R_DATA[56]}]
set_max_transition 3 [get_ports {R_DATA[55]}]
set_max_transition 3 [get_ports {R_DATA[54]}]
set_max_transition 3 [get_ports {R_DATA[53]}]
set_max_transition 3 [get_ports {R_DATA[52]}]
set_max_transition 3 [get_ports {R_DATA[51]}]
set_max_transition 3 [get_ports {R_DATA[50]}]
set_max_transition 3 [get_ports {R_DATA[49]}]
set_max_transition 3 [get_ports {R_DATA[48]}]
set_max_transition 3 [get_ports {R_DATA[47]}]
set_max_transition 3 [get_ports {R_DATA[46]}]
set_max_transition 3 [get_ports {R_DATA[45]}]
set_max_transition 3 [get_ports {R_DATA[44]}]
set_max_transition 3 [get_ports {R_DATA[43]}]
set_max_transition 3 [get_ports {R_DATA[42]}]
set_max_transition 3 [get_ports {R_DATA[41]}]
set_max_transition 3 [get_ports {R_DATA[40]}]
set_max_transition 3 [get_ports {R_DATA[39]}]
set_max_transition 3 [get_ports {R_DATA[38]}]
set_max_transition 3 [get_ports {R_DATA[37]}]
set_max_transition 3 [get_ports {R_DATA[36]}]
set_max_transition 3 [get_ports {R_DATA[35]}]
set_max_transition 3 [get_ports {R_DATA[34]}]
set_max_transition 3 [get_ports {R_DATA[33]}]
set_max_transition 3 [get_ports {R_DATA[32]}]
set_max_transition 3 [get_ports {R_DATA[31]}]
set_max_transition 3 [get_ports {R_DATA[30]}]
set_max_transition 3 [get_ports {R_DATA[29]}]
set_max_transition 3 [get_ports {R_DATA[28]}]
set_max_transition 3 [get_ports {R_DATA[27]}]
set_max_transition 3 [get_ports {R_DATA[26]}]
set_max_transition 3 [get_ports {R_DATA[25]}]
set_max_transition 3 [get_ports {R_DATA[24]}]
set_max_transition 3 [get_ports {R_DATA[23]}]
set_max_transition 3 [get_ports {R_DATA[22]}]
set_max_transition 3 [get_ports {R_DATA[21]}]
set_max_transition 3 [get_ports {R_DATA[20]}]
set_max_transition 3 [get_ports {R_DATA[19]}]
set_max_transition 3 [get_ports {R_DATA[18]}]
set_max_transition 3 [get_ports {R_DATA[17]}]
set_max_transition 3 [get_ports {R_DATA[16]}]
set_max_transition 3 [get_ports {R_DATA[15]}]
set_max_transition 3 [get_ports {R_DATA[14]}]
set_max_transition 3 [get_ports {R_DATA[13]}]
set_max_transition 3 [get_ports {R_DATA[12]}]
set_max_transition 3 [get_ports {R_DATA[11]}]
set_max_transition 3 [get_ports {R_DATA[10]}]
set_max_transition 3 [get_ports {R_DATA[9]}]
set_max_transition 3 [get_ports {R_DATA[8]}]
set_max_transition 3 [get_ports {R_DATA[7]}]
set_max_transition 3 [get_ports {R_DATA[6]}]
set_max_transition 3 [get_ports {R_DATA[5]}]
set_max_transition 3 [get_ports {R_DATA[4]}]
set_max_transition 3 [get_ports {R_DATA[3]}]
set_max_transition 3 [get_ports {R_DATA[2]}]
set_max_transition 3 [get_ports {R_DATA[1]}]
set_max_transition 3 [get_ports {R_DATA[0]}]
set_max_transition 3 [get_ports AW_READY]
set_max_transition 3 [get_ports W_READY]
set_max_transition 3 [get_ports B_VALID]
set_max_transition 3 [get_ports {B_RESP[1]}]
set_max_transition 3 [get_ports {B_RESP[0]}]
set_max_transition 3 [get_ports MISO]
create_clock [get_ports clk]  -period 40  -waveform {0 20}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 20  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 20  [get_ports direction]
set_input_delay -clock clk  -min 0  [get_ports direction]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[12]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[12]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[11]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[11]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[10]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[10]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[9]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[9]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[8]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[8]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[7]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[7]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[6]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[6]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[5]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[5]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[4]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[4]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[3]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[3]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[2]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[2]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[1]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[1]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_dram[0]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_dram[0]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[15]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[15]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[14]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[14]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[13]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[13]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[12]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[12]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[11]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[11]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[10]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[10]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[9]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[9]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[8]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[8]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[7]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[7]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[6]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[6]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[5]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[5]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[4]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[4]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[3]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[3]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[2]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[2]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[1]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[1]}]
set_input_delay -clock clk  -max 20  [get_ports {addr_sd[0]}]
set_input_delay -clock clk  -min 0  [get_ports {addr_sd[0]}]
set_input_delay -clock clk  -max 20  [get_ports AR_READY]
set_input_delay -clock clk  -min 0  [get_ports AR_READY]
set_input_delay -clock clk  -max 20  [get_ports R_VALID]
set_input_delay -clock clk  -min 0  [get_ports R_VALID]
set_input_delay -clock clk  -max 20  [get_ports {R_RESP[1]}]
set_input_delay -clock clk  -min 0  [get_ports {R_RESP[1]}]
set_input_delay -clock clk  -max 20  [get_ports {R_RESP[0]}]
set_input_delay -clock clk  -min 0  [get_ports {R_RESP[0]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[63]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[63]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[62]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[62]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[61]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[61]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[60]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[60]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[59]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[59]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[58]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[58]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[57]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[57]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[56]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[56]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[55]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[55]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[54]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[54]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[53]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[53]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[52]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[52]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[51]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[51]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[50]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[50]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[49]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[49]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[48]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[48]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[47]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[47]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[46]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[46]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[45]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[45]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[44]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[44]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[43]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[43]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[42]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[42]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[41]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[41]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[40]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[40]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[39]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[39]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[38]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[38]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[37]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[37]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[36]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[36]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[35]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[35]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[34]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[34]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[33]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[33]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[32]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[32]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[31]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[31]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[30]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[30]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[29]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[29]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[28]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[28]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[27]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[27]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[26]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[26]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[25]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[25]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[24]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[24]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[23]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[23]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[22]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[22]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[21]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[21]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[20]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[20]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[19]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[19]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[18]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[18]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[17]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[17]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[16]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[16]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[15]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[15]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[14]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[14]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[13]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[13]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[12]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[12]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[11]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[11]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[10]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[10]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[9]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[9]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[8]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[8]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[7]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[7]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[6]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[6]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[5]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[5]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[4]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[4]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[3]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[3]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[2]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[2]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[1]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[1]}]
set_input_delay -clock clk  -max 20  [get_ports {R_DATA[0]}]
set_input_delay -clock clk  -min 0  [get_ports {R_DATA[0]}]
set_input_delay -clock clk  -max 20  [get_ports AW_READY]
set_input_delay -clock clk  -min 0  [get_ports AW_READY]
set_input_delay -clock clk  -max 20  [get_ports W_READY]
set_input_delay -clock clk  -min 0  [get_ports W_READY]
set_input_delay -clock clk  -max 20  [get_ports B_VALID]
set_input_delay -clock clk  -min 0  [get_ports B_VALID]
set_input_delay -clock clk  -max 20  [get_ports {B_RESP[1]}]
set_input_delay -clock clk  -min 0  [get_ports {B_RESP[1]}]
set_input_delay -clock clk  -max 20  [get_ports {B_RESP[0]}]
set_input_delay -clock clk  -min 0  [get_ports {B_RESP[0]}]
set_input_delay -clock clk  -max 20  [get_ports MISO]
set_input_delay -clock clk  -min 0  [get_ports MISO]
set_output_delay -clock clk  -max 20  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 20  [get_ports {out_data[7]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[7]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[6]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[6]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[5]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[5]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[4]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[4]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[3]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[3]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[2]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[2]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[1]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[1]}]
set_output_delay -clock clk  -max 20  [get_ports {out_data[0]}]
set_output_delay -clock clk  -min 0  [get_ports {out_data[0]}]
set_output_delay -clock clk  -max 20  [get_ports AR_VALID]
set_output_delay -clock clk  -min 0  [get_ports AR_VALID]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[31]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[31]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[30]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[30]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[29]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[29]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[28]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[28]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[27]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[27]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[26]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[26]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[25]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[25]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[24]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[24]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[23]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[23]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[22]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[22]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[21]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[21]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[20]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[20]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[19]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[19]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[18]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[18]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[17]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[17]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[16]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[16]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[15]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[15]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[14]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[14]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[13]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[13]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[12]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[12]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[11]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[11]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[10]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[10]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[9]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[9]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[8]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[8]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[7]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[7]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[6]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[6]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[5]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[5]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[4]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[4]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[3]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[3]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[2]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[2]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[1]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[1]}]
set_output_delay -clock clk  -max 20  [get_ports {AR_ADDR[0]}]
set_output_delay -clock clk  -min 0  [get_ports {AR_ADDR[0]}]
set_output_delay -clock clk  -max 20  [get_ports R_READY]
set_output_delay -clock clk  -min 0  [get_ports R_READY]
set_output_delay -clock clk  -max 20  [get_ports AW_VALID]
set_output_delay -clock clk  -min 0  [get_ports AW_VALID]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[31]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[31]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[30]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[30]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[29]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[29]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[28]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[28]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[27]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[27]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[26]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[26]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[25]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[25]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[24]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[24]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[23]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[23]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[22]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[22]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[21]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[21]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[20]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[20]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[19]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[19]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[18]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[18]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[17]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[17]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[16]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[16]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[15]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[15]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[14]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[14]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[13]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[13]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[12]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[12]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[11]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[11]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[10]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[10]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[9]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[9]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[8]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[8]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[7]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[7]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[6]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[6]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[5]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[5]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[4]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[4]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[3]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[3]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[2]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[2]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[1]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[1]}]
set_output_delay -clock clk  -max 20  [get_ports {AW_ADDR[0]}]
set_output_delay -clock clk  -min 0  [get_ports {AW_ADDR[0]}]
set_output_delay -clock clk  -max 20  [get_ports W_VALID]
set_output_delay -clock clk  -min 0  [get_ports W_VALID]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[63]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[63]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[62]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[62]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[61]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[61]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[60]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[60]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[59]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[59]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[58]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[58]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[57]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[57]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[56]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[56]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[55]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[55]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[54]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[54]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[53]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[53]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[52]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[52]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[51]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[51]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[50]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[50]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[49]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[49]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[48]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[48]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[47]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[47]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[46]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[46]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[45]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[45]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[44]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[44]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[43]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[43]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[42]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[42]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[41]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[41]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[40]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[40]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[39]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[39]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[38]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[38]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[37]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[37]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[36]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[36]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[35]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[35]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[34]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[34]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[33]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[33]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[32]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[32]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[31]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[31]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[30]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[30]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[29]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[29]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[28]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[28]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[27]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[27]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[26]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[26]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[25]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[25]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[24]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[24]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[23]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[23]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[22]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[22]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[21]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[21]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[20]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[20]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[19]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[19]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[18]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[18]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[17]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[17]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[16]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[16]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[15]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[15]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[14]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[14]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[13]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[13]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[12]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[12]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[11]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[11]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[10]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[10]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[9]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[9]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[8]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[8]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[7]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[7]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[6]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[6]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[5]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[5]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[4]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[4]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[3]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[3]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[2]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[2]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[1]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[1]}]
set_output_delay -clock clk  -max 20  [get_ports {W_DATA[0]}]
set_output_delay -clock clk  -min 0  [get_ports {W_DATA[0]}]
set_output_delay -clock clk  -max 20  [get_ports B_READY]
set_output_delay -clock clk  -min 0  [get_ports B_READY]
set_output_delay -clock clk  -max 20  [get_ports MOSI]
set_output_delay -clock clk  -min 0  [get_ports MOSI]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports direction]
set_input_transition -min 0.5  [get_ports direction]
set_input_transition -max 0.5  [get_ports {addr_dram[12]}]
set_input_transition -min 0.5  [get_ports {addr_dram[12]}]
set_input_transition -max 0.5  [get_ports {addr_dram[11]}]
set_input_transition -min 0.5  [get_ports {addr_dram[11]}]
set_input_transition -max 0.5  [get_ports {addr_dram[10]}]
set_input_transition -min 0.5  [get_ports {addr_dram[10]}]
set_input_transition -max 0.5  [get_ports {addr_dram[9]}]
set_input_transition -min 0.5  [get_ports {addr_dram[9]}]
set_input_transition -max 0.5  [get_ports {addr_dram[8]}]
set_input_transition -min 0.5  [get_ports {addr_dram[8]}]
set_input_transition -max 0.5  [get_ports {addr_dram[7]}]
set_input_transition -min 0.5  [get_ports {addr_dram[7]}]
set_input_transition -max 0.5  [get_ports {addr_dram[6]}]
set_input_transition -min 0.5  [get_ports {addr_dram[6]}]
set_input_transition -max 0.5  [get_ports {addr_dram[5]}]
set_input_transition -min 0.5  [get_ports {addr_dram[5]}]
set_input_transition -max 0.5  [get_ports {addr_dram[4]}]
set_input_transition -min 0.5  [get_ports {addr_dram[4]}]
set_input_transition -max 0.5  [get_ports {addr_dram[3]}]
set_input_transition -min 0.5  [get_ports {addr_dram[3]}]
set_input_transition -max 0.5  [get_ports {addr_dram[2]}]
set_input_transition -min 0.5  [get_ports {addr_dram[2]}]
set_input_transition -max 0.5  [get_ports {addr_dram[1]}]
set_input_transition -min 0.5  [get_ports {addr_dram[1]}]
set_input_transition -max 0.5  [get_ports {addr_dram[0]}]
set_input_transition -min 0.5  [get_ports {addr_dram[0]}]
set_input_transition -max 0.5  [get_ports {addr_sd[15]}]
set_input_transition -min 0.5  [get_ports {addr_sd[15]}]
set_input_transition -max 0.5  [get_ports {addr_sd[14]}]
set_input_transition -min 0.5  [get_ports {addr_sd[14]}]
set_input_transition -max 0.5  [get_ports {addr_sd[13]}]
set_input_transition -min 0.5  [get_ports {addr_sd[13]}]
set_input_transition -max 0.5  [get_ports {addr_sd[12]}]
set_input_transition -min 0.5  [get_ports {addr_sd[12]}]
set_input_transition -max 0.5  [get_ports {addr_sd[11]}]
set_input_transition -min 0.5  [get_ports {addr_sd[11]}]
set_input_transition -max 0.5  [get_ports {addr_sd[10]}]
set_input_transition -min 0.5  [get_ports {addr_sd[10]}]
set_input_transition -max 0.5  [get_ports {addr_sd[9]}]
set_input_transition -min 0.5  [get_ports {addr_sd[9]}]
set_input_transition -max 0.5  [get_ports {addr_sd[8]}]
set_input_transition -min 0.5  [get_ports {addr_sd[8]}]
set_input_transition -max 0.5  [get_ports {addr_sd[7]}]
set_input_transition -min 0.5  [get_ports {addr_sd[7]}]
set_input_transition -max 0.5  [get_ports {addr_sd[6]}]
set_input_transition -min 0.5  [get_ports {addr_sd[6]}]
set_input_transition -max 0.5  [get_ports {addr_sd[5]}]
set_input_transition -min 0.5  [get_ports {addr_sd[5]}]
set_input_transition -max 0.5  [get_ports {addr_sd[4]}]
set_input_transition -min 0.5  [get_ports {addr_sd[4]}]
set_input_transition -max 0.5  [get_ports {addr_sd[3]}]
set_input_transition -min 0.5  [get_ports {addr_sd[3]}]
set_input_transition -max 0.5  [get_ports {addr_sd[2]}]
set_input_transition -min 0.5  [get_ports {addr_sd[2]}]
set_input_transition -max 0.5  [get_ports {addr_sd[1]}]
set_input_transition -min 0.5  [get_ports {addr_sd[1]}]
set_input_transition -max 0.5  [get_ports {addr_sd[0]}]
set_input_transition -min 0.5  [get_ports {addr_sd[0]}]
set_input_transition -max 0.5  [get_ports AR_READY]
set_input_transition -min 0.5  [get_ports AR_READY]
set_input_transition -max 0.5  [get_ports R_VALID]
set_input_transition -min 0.5  [get_ports R_VALID]
set_input_transition -max 0.5  [get_ports {R_RESP[1]}]
set_input_transition -min 0.5  [get_ports {R_RESP[1]}]
set_input_transition -max 0.5  [get_ports {R_RESP[0]}]
set_input_transition -min 0.5  [get_ports {R_RESP[0]}]
set_input_transition -max 0.5  [get_ports {R_DATA[63]}]
set_input_transition -min 0.5  [get_ports {R_DATA[63]}]
set_input_transition -max 0.5  [get_ports {R_DATA[62]}]
set_input_transition -min 0.5  [get_ports {R_DATA[62]}]
set_input_transition -max 0.5  [get_ports {R_DATA[61]}]
set_input_transition -min 0.5  [get_ports {R_DATA[61]}]
set_input_transition -max 0.5  [get_ports {R_DATA[60]}]
set_input_transition -min 0.5  [get_ports {R_DATA[60]}]
set_input_transition -max 0.5  [get_ports {R_DATA[59]}]
set_input_transition -min 0.5  [get_ports {R_DATA[59]}]
set_input_transition -max 0.5  [get_ports {R_DATA[58]}]
set_input_transition -min 0.5  [get_ports {R_DATA[58]}]
set_input_transition -max 0.5  [get_ports {R_DATA[57]}]
set_input_transition -min 0.5  [get_ports {R_DATA[57]}]
set_input_transition -max 0.5  [get_ports {R_DATA[56]}]
set_input_transition -min 0.5  [get_ports {R_DATA[56]}]
set_input_transition -max 0.5  [get_ports {R_DATA[55]}]
set_input_transition -min 0.5  [get_ports {R_DATA[55]}]
set_input_transition -max 0.5  [get_ports {R_DATA[54]}]
set_input_transition -min 0.5  [get_ports {R_DATA[54]}]
set_input_transition -max 0.5  [get_ports {R_DATA[53]}]
set_input_transition -min 0.5  [get_ports {R_DATA[53]}]
set_input_transition -max 0.5  [get_ports {R_DATA[52]}]
set_input_transition -min 0.5  [get_ports {R_DATA[52]}]
set_input_transition -max 0.5  [get_ports {R_DATA[51]}]
set_input_transition -min 0.5  [get_ports {R_DATA[51]}]
set_input_transition -max 0.5  [get_ports {R_DATA[50]}]
set_input_transition -min 0.5  [get_ports {R_DATA[50]}]
set_input_transition -max 0.5  [get_ports {R_DATA[49]}]
set_input_transition -min 0.5  [get_ports {R_DATA[49]}]
set_input_transition -max 0.5  [get_ports {R_DATA[48]}]
set_input_transition -min 0.5  [get_ports {R_DATA[48]}]
set_input_transition -max 0.5  [get_ports {R_DATA[47]}]
set_input_transition -min 0.5  [get_ports {R_DATA[47]}]
set_input_transition -max 0.5  [get_ports {R_DATA[46]}]
set_input_transition -min 0.5  [get_ports {R_DATA[46]}]
set_input_transition -max 0.5  [get_ports {R_DATA[45]}]
set_input_transition -min 0.5  [get_ports {R_DATA[45]}]
set_input_transition -max 0.5  [get_ports {R_DATA[44]}]
set_input_transition -min 0.5  [get_ports {R_DATA[44]}]
set_input_transition -max 0.5  [get_ports {R_DATA[43]}]
set_input_transition -min 0.5  [get_ports {R_DATA[43]}]
set_input_transition -max 0.5  [get_ports {R_DATA[42]}]
set_input_transition -min 0.5  [get_ports {R_DATA[42]}]
set_input_transition -max 0.5  [get_ports {R_DATA[41]}]
set_input_transition -min 0.5  [get_ports {R_DATA[41]}]
set_input_transition -max 0.5  [get_ports {R_DATA[40]}]
set_input_transition -min 0.5  [get_ports {R_DATA[40]}]
set_input_transition -max 0.5  [get_ports {R_DATA[39]}]
set_input_transition -min 0.5  [get_ports {R_DATA[39]}]
set_input_transition -max 0.5  [get_ports {R_DATA[38]}]
set_input_transition -min 0.5  [get_ports {R_DATA[38]}]
set_input_transition -max 0.5  [get_ports {R_DATA[37]}]
set_input_transition -min 0.5  [get_ports {R_DATA[37]}]
set_input_transition -max 0.5  [get_ports {R_DATA[36]}]
set_input_transition -min 0.5  [get_ports {R_DATA[36]}]
set_input_transition -max 0.5  [get_ports {R_DATA[35]}]
set_input_transition -min 0.5  [get_ports {R_DATA[35]}]
set_input_transition -max 0.5  [get_ports {R_DATA[34]}]
set_input_transition -min 0.5  [get_ports {R_DATA[34]}]
set_input_transition -max 0.5  [get_ports {R_DATA[33]}]
set_input_transition -min 0.5  [get_ports {R_DATA[33]}]
set_input_transition -max 0.5  [get_ports {R_DATA[32]}]
set_input_transition -min 0.5  [get_ports {R_DATA[32]}]
set_input_transition -max 0.5  [get_ports {R_DATA[31]}]
set_input_transition -min 0.5  [get_ports {R_DATA[31]}]
set_input_transition -max 0.5  [get_ports {R_DATA[30]}]
set_input_transition -min 0.5  [get_ports {R_DATA[30]}]
set_input_transition -max 0.5  [get_ports {R_DATA[29]}]
set_input_transition -min 0.5  [get_ports {R_DATA[29]}]
set_input_transition -max 0.5  [get_ports {R_DATA[28]}]
set_input_transition -min 0.5  [get_ports {R_DATA[28]}]
set_input_transition -max 0.5  [get_ports {R_DATA[27]}]
set_input_transition -min 0.5  [get_ports {R_DATA[27]}]
set_input_transition -max 0.5  [get_ports {R_DATA[26]}]
set_input_transition -min 0.5  [get_ports {R_DATA[26]}]
set_input_transition -max 0.5  [get_ports {R_DATA[25]}]
set_input_transition -min 0.5  [get_ports {R_DATA[25]}]
set_input_transition -max 0.5  [get_ports {R_DATA[24]}]
set_input_transition -min 0.5  [get_ports {R_DATA[24]}]
set_input_transition -max 0.5  [get_ports {R_DATA[23]}]
set_input_transition -min 0.5  [get_ports {R_DATA[23]}]
set_input_transition -max 0.5  [get_ports {R_DATA[22]}]
set_input_transition -min 0.5  [get_ports {R_DATA[22]}]
set_input_transition -max 0.5  [get_ports {R_DATA[21]}]
set_input_transition -min 0.5  [get_ports {R_DATA[21]}]
set_input_transition -max 0.5  [get_ports {R_DATA[20]}]
set_input_transition -min 0.5  [get_ports {R_DATA[20]}]
set_input_transition -max 0.5  [get_ports {R_DATA[19]}]
set_input_transition -min 0.5  [get_ports {R_DATA[19]}]
set_input_transition -max 0.5  [get_ports {R_DATA[18]}]
set_input_transition -min 0.5  [get_ports {R_DATA[18]}]
set_input_transition -max 0.5  [get_ports {R_DATA[17]}]
set_input_transition -min 0.5  [get_ports {R_DATA[17]}]
set_input_transition -max 0.5  [get_ports {R_DATA[16]}]
set_input_transition -min 0.5  [get_ports {R_DATA[16]}]
set_input_transition -max 0.5  [get_ports {R_DATA[15]}]
set_input_transition -min 0.5  [get_ports {R_DATA[15]}]
set_input_transition -max 0.5  [get_ports {R_DATA[14]}]
set_input_transition -min 0.5  [get_ports {R_DATA[14]}]
set_input_transition -max 0.5  [get_ports {R_DATA[13]}]
set_input_transition -min 0.5  [get_ports {R_DATA[13]}]
set_input_transition -max 0.5  [get_ports {R_DATA[12]}]
set_input_transition -min 0.5  [get_ports {R_DATA[12]}]
set_input_transition -max 0.5  [get_ports {R_DATA[11]}]
set_input_transition -min 0.5  [get_ports {R_DATA[11]}]
set_input_transition -max 0.5  [get_ports {R_DATA[10]}]
set_input_transition -min 0.5  [get_ports {R_DATA[10]}]
set_input_transition -max 0.5  [get_ports {R_DATA[9]}]
set_input_transition -min 0.5  [get_ports {R_DATA[9]}]
set_input_transition -max 0.5  [get_ports {R_DATA[8]}]
set_input_transition -min 0.5  [get_ports {R_DATA[8]}]
set_input_transition -max 0.5  [get_ports {R_DATA[7]}]
set_input_transition -min 0.5  [get_ports {R_DATA[7]}]
set_input_transition -max 0.5  [get_ports {R_DATA[6]}]
set_input_transition -min 0.5  [get_ports {R_DATA[6]}]
set_input_transition -max 0.5  [get_ports {R_DATA[5]}]
set_input_transition -min 0.5  [get_ports {R_DATA[5]}]
set_input_transition -max 0.5  [get_ports {R_DATA[4]}]
set_input_transition -min 0.5  [get_ports {R_DATA[4]}]
set_input_transition -max 0.5  [get_ports {R_DATA[3]}]
set_input_transition -min 0.5  [get_ports {R_DATA[3]}]
set_input_transition -max 0.5  [get_ports {R_DATA[2]}]
set_input_transition -min 0.5  [get_ports {R_DATA[2]}]
set_input_transition -max 0.5  [get_ports {R_DATA[1]}]
set_input_transition -min 0.5  [get_ports {R_DATA[1]}]
set_input_transition -max 0.5  [get_ports {R_DATA[0]}]
set_input_transition -min 0.5  [get_ports {R_DATA[0]}]
set_input_transition -max 0.5  [get_ports AW_READY]
set_input_transition -min 0.5  [get_ports AW_READY]
set_input_transition -max 0.5  [get_ports W_READY]
set_input_transition -min 0.5  [get_ports W_READY]
set_input_transition -max 0.5  [get_ports B_VALID]
set_input_transition -min 0.5  [get_ports B_VALID]
set_input_transition -max 0.5  [get_ports {B_RESP[1]}]
set_input_transition -min 0.5  [get_ports {B_RESP[1]}]
set_input_transition -max 0.5  [get_ports {B_RESP[0]}]
set_input_transition -min 0.5  [get_ports {B_RESP[0]}]
set_input_transition -max 0.5  [get_ports MISO]
set_input_transition -min 0.5  [get_ports MISO]
