###################################################################

# Created by write_sdc on Mon Jan 22 13:39:55 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {xo[7]}]
set_load -pin_load 0.05 [get_ports {xo[6]}]
set_load -pin_load 0.05 [get_ports {xo[5]}]
set_load -pin_load 0.05 [get_ports {xo[4]}]
set_load -pin_load 0.05 [get_ports {xo[3]}]
set_load -pin_load 0.05 [get_ports {xo[2]}]
set_load -pin_load 0.05 [get_ports {xo[1]}]
set_load -pin_load 0.05 [get_ports {xo[0]}]
set_load -pin_load 0.05 [get_ports {yo[7]}]
set_load -pin_load 0.05 [get_ports {yo[6]}]
set_load -pin_load 0.05 [get_ports {yo[5]}]
set_load -pin_load 0.05 [get_ports {yo[4]}]
set_load -pin_load 0.05 [get_ports {yo[3]}]
set_load -pin_load 0.05 [get_ports {yo[2]}]
set_load -pin_load 0.05 [get_ports {yo[1]}]
set_load -pin_load 0.05 [get_ports {yo[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst_n]
set_max_capacitance 0.15 [get_ports in_valid]
set_max_capacitance 0.15 [get_ports {mode[1]}]
set_max_capacitance 0.15 [get_ports {mode[0]}]
set_max_capacitance 0.15 [get_ports {xi[7]}]
set_max_capacitance 0.15 [get_ports {xi[6]}]
set_max_capacitance 0.15 [get_ports {xi[5]}]
set_max_capacitance 0.15 [get_ports {xi[4]}]
set_max_capacitance 0.15 [get_ports {xi[3]}]
set_max_capacitance 0.15 [get_ports {xi[2]}]
set_max_capacitance 0.15 [get_ports {xi[1]}]
set_max_capacitance 0.15 [get_ports {xi[0]}]
set_max_capacitance 0.15 [get_ports {yi[7]}]
set_max_capacitance 0.15 [get_ports {yi[6]}]
set_max_capacitance 0.15 [get_ports {yi[5]}]
set_max_capacitance 0.15 [get_ports {yi[4]}]
set_max_capacitance 0.15 [get_ports {yi[3]}]
set_max_capacitance 0.15 [get_ports {yi[2]}]
set_max_capacitance 0.15 [get_ports {yi[1]}]
set_max_capacitance 0.15 [get_ports {yi[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst_n]
set_max_fanout 10 [get_ports in_valid]
set_max_fanout 10 [get_ports {mode[1]}]
set_max_fanout 10 [get_ports {mode[0]}]
set_max_fanout 10 [get_ports {xi[7]}]
set_max_fanout 10 [get_ports {xi[6]}]
set_max_fanout 10 [get_ports {xi[5]}]
set_max_fanout 10 [get_ports {xi[4]}]
set_max_fanout 10 [get_ports {xi[3]}]
set_max_fanout 10 [get_ports {xi[2]}]
set_max_fanout 10 [get_ports {xi[1]}]
set_max_fanout 10 [get_ports {xi[0]}]
set_max_fanout 10 [get_ports {yi[7]}]
set_max_fanout 10 [get_ports {yi[6]}]
set_max_fanout 10 [get_ports {yi[5]}]
set_max_fanout 10 [get_ports {yi[4]}]
set_max_fanout 10 [get_ports {yi[3]}]
set_max_fanout 10 [get_ports {yi[2]}]
set_max_fanout 10 [get_ports {yi[1]}]
set_max_fanout 10 [get_ports {yi[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst_n]
set_max_transition 3 [get_ports in_valid]
set_max_transition 3 [get_ports {mode[1]}]
set_max_transition 3 [get_ports {mode[0]}]
set_max_transition 3 [get_ports {xi[7]}]
set_max_transition 3 [get_ports {xi[6]}]
set_max_transition 3 [get_ports {xi[5]}]
set_max_transition 3 [get_ports {xi[4]}]
set_max_transition 3 [get_ports {xi[3]}]
set_max_transition 3 [get_ports {xi[2]}]
set_max_transition 3 [get_ports {xi[1]}]
set_max_transition 3 [get_ports {xi[0]}]
set_max_transition 3 [get_ports {yi[7]}]
set_max_transition 3 [get_ports {yi[6]}]
set_max_transition 3 [get_ports {yi[5]}]
set_max_transition 3 [get_ports {yi[4]}]
set_max_transition 3 [get_ports {yi[3]}]
set_max_transition 3 [get_ports {yi[2]}]
set_max_transition 3 [get_ports {yi[1]}]
set_max_transition 3 [get_ports {yi[0]}]
create_clock [get_ports clk]  -period 12  -waveform {0 6}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  -max 6  [get_ports in_valid]
set_input_delay -clock clk  -min 0  [get_ports in_valid]
set_input_delay -clock clk  -max 6  [get_ports {mode[1]}]
set_input_delay -clock clk  -min 0  [get_ports {mode[1]}]
set_input_delay -clock clk  -max 6  [get_ports {mode[0]}]
set_input_delay -clock clk  -min 0  [get_ports {mode[0]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[7]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[7]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[6]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[6]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[5]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[5]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[4]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[4]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[3]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[3]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[2]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[2]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[1]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[1]}]
set_input_delay -clock clk  -max 6  [get_ports {xi[0]}]
set_input_delay -clock clk  -min 0  [get_ports {xi[0]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[7]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[7]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[6]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[6]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[5]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[5]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[4]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[4]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[3]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[3]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[2]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[2]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[1]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[1]}]
set_input_delay -clock clk  -max 6  [get_ports {yi[0]}]
set_input_delay -clock clk  -min 0  [get_ports {yi[0]}]
set_output_delay -clock clk  -max 6  [get_ports out_valid]
set_output_delay -clock clk  -min 0  [get_ports out_valid]
set_output_delay -clock clk  -max 6  [get_ports {xo[7]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[7]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[6]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[6]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[5]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[5]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[4]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[4]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[3]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[3]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[2]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[2]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[1]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[1]}]
set_output_delay -clock clk  -max 6  [get_ports {xo[0]}]
set_output_delay -clock clk  -min 0  [get_ports {xo[0]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[7]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[7]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[6]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[6]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[5]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[5]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[4]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[4]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[3]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[3]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[2]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[2]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[1]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[1]}]
set_output_delay -clock clk  -max 6  [get_ports {yo[0]}]
set_output_delay -clock clk  -min 0  [get_ports {yo[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports {mode[1]}]
set_input_transition -min 0.5  [get_ports {mode[1]}]
set_input_transition -max 0.5  [get_ports {mode[0]}]
set_input_transition -min 0.5  [get_ports {mode[0]}]
set_input_transition -max 0.5  [get_ports {xi[7]}]
set_input_transition -min 0.5  [get_ports {xi[7]}]
set_input_transition -max 0.5  [get_ports {xi[6]}]
set_input_transition -min 0.5  [get_ports {xi[6]}]
set_input_transition -max 0.5  [get_ports {xi[5]}]
set_input_transition -min 0.5  [get_ports {xi[5]}]
set_input_transition -max 0.5  [get_ports {xi[4]}]
set_input_transition -min 0.5  [get_ports {xi[4]}]
set_input_transition -max 0.5  [get_ports {xi[3]}]
set_input_transition -min 0.5  [get_ports {xi[3]}]
set_input_transition -max 0.5  [get_ports {xi[2]}]
set_input_transition -min 0.5  [get_ports {xi[2]}]
set_input_transition -max 0.5  [get_ports {xi[1]}]
set_input_transition -min 0.5  [get_ports {xi[1]}]
set_input_transition -max 0.5  [get_ports {xi[0]}]
set_input_transition -min 0.5  [get_ports {xi[0]}]
set_input_transition -max 0.5  [get_ports {yi[7]}]
set_input_transition -min 0.5  [get_ports {yi[7]}]
set_input_transition -max 0.5  [get_ports {yi[6]}]
set_input_transition -min 0.5  [get_ports {yi[6]}]
set_input_transition -max 0.5  [get_ports {yi[5]}]
set_input_transition -min 0.5  [get_ports {yi[5]}]
set_input_transition -max 0.5  [get_ports {yi[4]}]
set_input_transition -min 0.5  [get_ports {yi[4]}]
set_input_transition -max 0.5  [get_ports {yi[3]}]
set_input_transition -min 0.5  [get_ports {yi[3]}]
set_input_transition -max 0.5  [get_ports {yi[2]}]
set_input_transition -min 0.5  [get_ports {yi[2]}]
set_input_transition -max 0.5  [get_ports {yi[1]}]
set_input_transition -min 0.5  [get_ports {yi[1]}]
set_input_transition -max 0.5  [get_ports {yi[0]}]
set_input_transition -min 0.5  [get_ports {yi[0]}]
